Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: An escaping backslash can be used to include a whitespace or "#" character as part of the pattern.
es: Si el patrón es compilado con la opción PCRE_EXTENDED, los espacios en blanco en el patrón (fuera de una clase de caracteres) y los caracteres entre un "# "fuera de una clase de caracteres y el carácter de nueva líneaSi el patrón es compilado con la opción PCRE_EXTENDED, los espacios en blanco en el patrón (fuera de una clase de caracteres) y los caracteres entre un "#" fuera de una clase de caracteres y el carácter de nueva línea son ignorado.

source: A second use of backslash provides a way of encoding non - printing characters in patterns in a visible manner.
es: Una barra invertida de escape puede usarse para incluir un espacio en blanco o el carácter "#" como parte del patrón.

source: There is no restriction on the appearance of non-printing characters, apart from the binary zero that terminates a pattern, but when a pattern is being prepared by text editing, it is usually easier to use one of the following escape sequences than the binary character it represents:
es: Un segundo uso de la barra invertida sirve para codificar caracteres noUn segundo uso de la barra invertida sirve para codificar caracteres no imprimibles en los patrones de una manera visible.

source: "control-x", where x is any character
es: No hay restricciones sobre la apariencia de los caracteres no imprimibles, quitando el cero binario de terminación de un patrón, pero cuando un patrón es preparado con un editor de texto, normalmente es fácil utilizar una de las siguientes secuencias de escape que representan sus caracteres binarios: \a alarma, esto es, el carácter BEL (07 en hexadecimal) \cx "control-x", donde x es cualquier carácter \e escape (1B en hexadecimal) \f nueva página (0C en hexadecimal) \n nueva línea (0A en hexadecimal) \r retorno de carro (0D en hexadecimal) \t tabulador (09 en hexadecimal) \xhh carácter con código hh en hexadecimal \ddd carácter con código ddd en octal El efecto de "\cx "es como sigue: si "x" es una letra minúscula,No hay restricciones sobre la apariencia de los caracteres no imprimibles, quitando el cero binario de terminación de un patrón, pero cuando un patrón es preparado con un editor de texto, normalmente es fácil utilizar una de las siguientes secuencias de escape que representan sus caracteres binarios: \a alarma, esto es, el carácter BEL (07 en hexadecimal) \cx "control-x", donde x es cualquier carácter \e escape (1B en hexadecimal) \f nueva página (0C en hexadecimal) \n nueva línea (0A en hexadecimal) \r retorno de carro (0D en hexadecimal) \t tabulador (09 en hexadecimal) \xhh carácter con código hh en hexadecimal \ddd carácter con código ddd en octal El efecto de "\cx "es como sigue: si "x" es una letra minúscula, es convertida a mayúscula.

source: formfeed (hex 0C)
es: Entonces el sexto bit del carácter (40 enEntonces el sexto bit del carácter (40 en hexadecimal) es invertido.

source: carriage return (hex 0D)
es: Esto es, "\cz" es 1A en hexadecimal, pero "\c{ "es 3B en hexadecimal, mientras "\c;" es 7B en hexadecimal.

source: character with hex code hh
es: Después de "\x", hasta dos dígitos hexadecimales son leídos (las letras pueden ser mayúsculas o minúsculas).

source: character with octal code ddd, or backreference
es: Después de "\0" son leídos dos dígitos octales más.

source: The precise effect of "\cx" is as follows: if "x" is a lower case letter, it is converted to upper case.
es: En ambos casos, si hayEn ambos casos, si hay menos de dos dígitos, se usrará lo que haya.

source: Thus "\cz" becomes hex 1A, but "\c {" becomes hex 3B, while "\c;" becomes hex 7B.
es: Esto es, la secuencia "\0\x\07"Esto es, la secuencia "\0\x\07" indica dos ceros binarios seguidos por un carácter BEL.

source: After "\x", up to two hexadecimal digits are read (letters can be in upper or lower case).
es: Asegúrate dar dos dígitos después del inicial cero si el carácter que sigue es un dígito octal.

source: In both cases, if there are fewer than two digits, just those that are present are used.
es: El uso de una barra invertida seguido por otro dígito que no sea el ceroEl uso de una barra invertida seguido por otro dígito que no sea el cero es complejo.

source: Make sure you supply two digits after the initial zero if the character that follows is itself an octal digit.
es: Fuera de una clase carácter, PCRE interpreta cualquier dígitoFuera de una clase carácter, PCRE interpreta cualquier dígito como un número decimal.

source: Outside a character class, PCRE reads it and any following digits as a decimal number.
es: Si el número es menor que diez, o si ha habido al menos tantos paréntesis capturados a la izquierda en la expresión, entonces la secuencia entera es tomada como una back reference (referencia atrás).

source: If the number is less than 10, or if there have been at least that many previous capturing left parentheses in the expression, the entire sequence is taken as a back reference.
es: Una descripción de como trabaja esto es dada después, siguiendo la discusión de subpatrones con paréntesis.

source: Inside a character class, or if the decimal number is greater than 9 and there have not been that many capturing subpatterns, PCRE re-reads up to three octal digits following the backslash, and generates a single byte from the least significant 8 bits of the value.
es: Dentro de una clase carácter, o si el número decimal es mayor que nueve y no ha habido tantos subpatrones capturados PCRE relee los tres dígitos octales siguientes a la barra invertida y genera un byte desde los ochoDentro de una clase carácter, o si el número decimal es mayor que nueve y no ha habido tantos subpatrones capturados PCRE relee los tres dígitos octales siguientes a la barra invertida y genera un byte desde los ocho bits menos significativos del valor.

source: is another way of writing a space
es: Por ejemplo: \040 es otro modo de escribir un espacio \40 es lo mismo, siempre que haya menos de cuarenta subpatrones abiertos \7 siempre es una referencia atrás \11 puede ser una referencia atrás o un tabulador \011 siempre es un tabulador \0113 es el carácter con código octal 113 (ya que no puede haber más de noventa y nueve referencias atrás) \377 es un byte con todos sus bits a uno \81 puede ser una referencia atrás o un cero binario seguido por dos caracteres "8 "y "1" Ten en cuenta que el valor octal de un número mayor o igual a cien no debe ser precedido por un cero ya que no son leídos más de tres dígitos octales.

source: is always a back reference
es: Todas las secuencias que definen el valor de un byte pueden ser usadasTodas las secuencias que definen el valor de un byte pueden ser usadas tanto dentro como fuera de la clase carácter.

source: is always a tab
es: Además, la secuenciaAdemás, la secuencia "\b" es interpretada como el carácter backspace (hex 08) dentro.

source: is a tab followed by the character "3"
es: Fuera es definido de otra manera (ver más adelante).

source: is a byte consisting entirely of 1 bits
es: El tercer uso de la barra invertida es para especificar los tipos de caracteres genéricos: \d cualquier un dígito decimal \D cualquier carácter que no sea un dígito decimal \s cualquier carácter de espacio en blanco (whitespace) \S cualquier carácter que no sea un espacio en blanco \w cualquier carácter de "palabra "\W cualquier carácter que no se de "palabra" Cada pareja de secuencia de escape divide el conjunto global de caracteresEl tercer uso de la barra invertida es para especificar los tipos de caracteres genéricos: \d cualquier un dígito decimal \D cualquier carácter que no sea un dígito decimal \s cualquier carácter de espacio en blanco (whitespace) \S cualquier carácter que no sea un espacio en blanco \w cualquier carácter de "palabra "\W cualquier carácter que no se de "palabra" Cada pareja de secuencia de escape divide el conjunto global de caracteres en dos.

source: is either a back reference, or a binary zero followed by the two characters "8" and "1 "
es: Cualquier carácter dado empareja en uno y sólo uno de cada pareja.

source: All the sequences that define a single byte value can be used both inside and outside character classes.
es: Un carácter de "palabra" es cualquier letra o dígito o el carácter subrayado,Un carácter de "palabra "es cualquier letra o dígito o el carácter subrayado, esto es, cualquier carácter puede ser parte de una "palabra" en Perl.

source: Outside a character class it has a different meaning (see below).
es: La definición de letras y dígitos es controlada por la tabla de caracteres de PERL, y puede ser variada si las especificaciones regionales son tomadas enLa definición de letras y dígitos es controlada por la tabla de caracteres de PERL, y puede ser variada si las especificaciones regionales son tomadas en cuenta (ver "Soporte regional más adelante").

source: any decimal digit
es: Por ejemplo, en Francia algunos caracteres tienen un código superior a 128, para representar las letras acentuadas, y son emparejados por \w.

source: any whitespace character
es: Estas secuencias de tipos de caracteres pueden aparecer tanto dentro comoEstas secuencias de tipos de caracteres pueden aparecer tanto dentro como fuera de las clases carácter.

source: any "word" character
es: Cada una casa un carácter del tipo apropiado.

source: Each pair of escape sequences partitions the complete set of characters into two disjoint sets.
es: Si el punto de casamiento actual es el final de la cadena, todo ello falla, ya que no hay más caracteres que casar.

source: A "word" character is any letter or digit or the underscore character, that is, any character which can be part of a Perl "word".
es: El cuarto uso de la barra invertida es para ciertas sentencias (assertions).

source: For example, in the "fr" (French) locale, some char - acter codes greater than 128 are used for accented letters, and these are matched by \w.
es: Una sentencia especifica una condición que tiene que ser encontrada en un punto particular de un emparejamiento, sin utilizar ningún carácter de laUna sentencia especifica una condición que tiene que ser encontrada en un punto particular de un emparejamiento, sin utilizar ningún carácter de la cadena de entrada.

source: They each match one character of the appropriate type.
es: El uso de subpatrones para sentencias más complicadasEl uso de subpatrones para sentencias más complicadas es descrito después.

source: The fourth use of backslash is for certain simple asser - tions.
es: Las sentencias de barra invertida son \b limites de palabra \B no sean limites de palabra \A inicio de la cadena de entrada (independiente del modo multilínea) \Z fin de la cadena de entrada o de una nueva línea delante del final (independiente del modo multilínea) \z fin de la cadena de entrada (independiente de modo multilínea) Estas sentencias no pueden aparecer dentro de una clase carácter (pero ten en cuenta que "\b "tiene un significado diferente, quiere decir el carácter backspace dentro de una clase carácter) Un límite de palabra es una posición en la cadena de entrada donde un carácter y el anterior no emparejan con \w o \W (por ejemplo, uno casa con \w y el otro con \W), o el principio o el final de la cadena si el primero o el último carácter emparejan con \w, respectivamente.

source: The use of subpatterns for more complicated assertions is described below.
es: Las sentencias \A, \Z y \z se diferencian de los tradicionales circunflejo y dólar (ver más adelante) en que sólo emparejan el inicio y fin de laLas sentencias \A, \Z y \z se diferencian de los tradicionales circunflejo y dólar (ver más adelante) en que sólo emparejan el inicio y fin de la cadena de entrada sin tener en cuenta las opciones definidas.

source: start of subject (independent of multiline mode)
es: No les afectanNo les afectan las opciones PCRE_NOTBOL o PCRE_NOTEOL.

source: end of subject( independent of multiline mode)
es: La diferencia entre \Z y \z es que \Z casa antes una nueva línea que es el último carácter de la cadena como también el final de la cadena, sin embargo \z sólo casa el final.

source: A word boundary is a position in the subject string where the current character and the previous character do not both match \w or \W (i.e. one matches \w and the other matches \W), or the start or end of the string if the first or last character matches \w, respectively.
es: CIRCUNFLEJO Y DOLAR Fuera de una clase carácter, en el modo de emparejamiento por defecto, el carácter circunflejo es una sentencia la cual es verdadera sólo si el puntoCIRCUNFLEJO Y DOLAR Fuera de una clase carácter, en el modo de emparejamiento por defecto, el carácter circunflejo es una sentencia la cual es verdadera sólo si el punto de casamiento actual es el inicio de la cadena de entrada.

source: The \A, \Z, and \z assertions differ from the traditional circumflex and dollar (described below) in that they only ever match at the very start and end of the subject string, whatever options are set.
es: Dentro de una clase carácter, el circunflejo tiene significado completamente distinto (ver más adelante).

source: The difference between \Z and \z is that \Z matches before a newline that is the last character of the string as well as at the end of the string, whereas \z matches only at the end.
es: El circunflejo no necesita ser el primer carácter del patrón si son posibles un número de alternativas, pero será la primera cosa en cada alternativa en la cual aparezca si el patrón casa esa opción.

source: Outside a character class, in the default matching mode, the circumflex character is an assertion which is true only if the current matching point is at the start of the subjectOutside a character class, in the default matching mode, the circumflex character is an assertion which is true only if the current matching point is at the start of the subject string.
es: Si todas las alternativas posibles empiezan con un circunflejo, esto es, si el patrón es obligado a casar sólo con en el inicio de la cadena de entrada,Si todas las alternativas posibles empiezan con un circunflejo, esto es, si el patrón es obligado a casar sólo con en el inicio de la cadena de entrada, se dice que es un patrón "anclado".

source: Inside a character class, circumflex has an entirely different meaning (see below).
es: También hay otros constructores que pueden hacer que un patrón sea anclado.

source: If all possible alter - natives start with a circumflex, that is, if the pattern is constrained to match only at the start of the subject, it is said to be an "anchored" pattern. (There are also other con - structs that can cause a pattern to be anchored.) A dollar character is an assertion which is TRUE only if the current matching point is at the end of the subject string, or immediately before a newline character that is the lastIf all possible alter - natives start with a circumflex, that is, if the pattern is constrained to match only at the start of the subject, it is said to be an "anchored "pattern. (There are also other con - structs that can cause a pattern to be anchored.) A dollar character is an assertion which is TRUE only if the current matching point is at the end of the subject string, or immediately before a newline character that is the last character in the string (by default).
es: Un carácter de dólar es una sentencia que es verdadera sólo si el punto de emparejamiento actual es el final de la cadena de entrada, o inmediatamente antes de un carácter de nueva línea, el cual es el últimoUn carácter de dólar es una sentencia que es verdadera sólo si el punto de emparejamiento actual es el final de la cadena de entrada, o inmediatamente antes de un carácter de nueva línea, el cual es el último carácter en la cadena, por defecto.

source: Dollar need not be the last character of the pattern if a number of alternatives are involved, but it should be the last item in any branchDollar need not be the last character of the pattern if a number of alternatives are involved, but it should be the last item in any branch in which it appears.
es: El dólar no necesita ser el último carácter del patrón si hay varias alternativas, pero será el último elementoEl dólar no necesita ser el último carácter del patrón si hay varias alternativas, pero será el último elemento en cualquier alternativa en el que aparezca.

source: Dollar has no special meaning in a character class.
es: El dólar no tiene un significado especial en una clase carácter.

source: The meaning of dollar can be changed so that it matches only at the very end of the string, by setting the PCRE_DOLLAR_ENDONLY The meaning of dollar can be changed so that it matches only at the very end of the string, by setting the PCRE_DOLLAR_ENDONLY option at compile or matching time.
es: El significado del dólar puede ser cambiado para que sólo empareje el final de la cadena de entrada definiendo la opción PCRE_DOLLAR_ENDONLY a laEl significado del dólar puede ser cambiado para que sólo empareje el final de la cadena de entrada definiendo la opción PCRE_DOLLAR_ENDONLY a la hora de compilar o tiempo de ejecución.

source: This does not affect the \Z assertion.
es: Esto no afecta a la sentencia \Z.

source: The meanings of the circumflex and dollar characters are changed if the PCRE_MULTILINE option is set.
es: El significado de los caracteres circunflejo y dólar cambia si la opciónEl significado de los caracteres circunflejo y dólar cambia si la opción PCRE_MULTILINE es definida.

source: When this is the case, they match immediately after and immediately before an internal "\n" character, respectively, in additionWhen this is the case, they match immediately after and immediately before an internal "\n "character, respectively, in addition to matching at the start and end of the subject string.
es: Cuando éste es el caso, casan, respectivamente, inmediatamente antes y después de un carácter "\n" interno,Cuando éste es el caso, casan, respectivamente, inmediatamente antes y después de un carácter "\n "interno, además de emparejar con el inicio y el final de la cadena.

source: For example, the pattern / ^abc$ / matches the subject stringFor example, the pattern / ^abc$ / matches the subject string "def\nabc" in multiline mode, but not otherwise.
es: Por ejemplo, el patrón / ^abc$ / casa con la cadena de entrada "def\nabc" en modo multilínea,Por ejemplo, el patrón / ^abc$ / casa con la cadena de entrada "def\nabc "en modo multilínea, pero en otro modo no.

source: Conse - quently, patterns that are anchored in single line mode because all branches start with "^" are not anchored in mul-Conse - quently, patterns that are anchored in single line mode because all branches start with "^ "are not anchored in mul - tiline mode.
es: Consecuentemente, los patrones anclados son en modo línea ya que todas las opciones que empiezan con "^" no son ancladas en modoConsecuentemente, los patrones anclados son en modo línea ya que todas las opciones que empiezan con "^ "no son ancladas en modo multilínea.

source: The PCRE_DOLLAR_ENDONLY option is ignored if PCRE_MULTILINE is set.
es: La opción PCRE_DOLLAR_ENDONLY es ignorada si PCRE_MULTILINE es definido.

source: Note that the sequences \A, \Z, and \z can be used to match the start and end of the subject in both modes, and if all branches of a pattern start with \A is it always anchored, whether PCRE_MULTILINE is set or not.
es: Ten en cuenta que las secuencias \A, \Z y \z pueden ser usadas para casar el inicio y el final de la cadena en ambos modos, y si todas las opciones de un patrón empiezan con \A siempre es anclado, independientemente de si PCRE_MULTILINE es definido o no.

source: If the PCRE_DOTALL If the PCRE_DOTALL option is set, then dots match newlines as well.
es: FINAL (PUNTO) Fuera de una clase carácter, un punto en el patrón casa con un carácter cualquiera en la cadena de entrada, incluyendo un carácter no imprimible,FINAL (PUNTO) Fuera de una clase carácter, un punto en el patrón casa con un carácter cualquiera en la cadena de entrada, incluyendo un carácter no imprimible, exceptuando el de nueva línea (por defecto).

source: Dot has no special meaning in a character class.
es: El manejo de puntos es completamente independiente del uso del circunflejo y elEl manejo de puntos es completamente independiente del uso del circunflejo y el dólar, la única relación entre ellos son los caracteres de nueva línea.

source: An opening square bracket introduces a character class, ter-An opening square bracket introduces a character class, ter - minated by a closing square bracket.
es: CORCHETES Un corchete de apertura crea una clase carácter, terminada por uno de cierre.

source: A closing squareA closing square bracket on its own is not special.
es: Un corchete de cierre no tiene un significado especial.

source: If a closing square bracket is required as a member of the class, it should be the first data character in the class (after an initial cir - cumflex, if present) or escaped with a backslash.
es: Si un corchete de cierre es necesitado como un miembro de la clase, será el primer carácter de datos en la clase (después de un circunflejo inicial, si está presente) o con una barra invertida antes.

source: A character class matches a single character in the subject; the character must be in the set of characters defined by the class, unless the first character in the class is a cir - cumflex, in which case the subject character must not be inA character class matches a single character in the subject; the character must be in the set of characters defined by the class, unless the first character in the class is a cir - cumflex, in which case the subject character must not be in the set defined by the class.
es: Si una clase carácter casa con un carácter único en la cadena; el carácter debe estar en el conjunto de los caracteres definidos por la clase, a menos que el primero sea un circunflejo, en cuyo caso el carácter de la cadena deSi una clase carácter casa con un carácter único en la cadena; el carácter debe estar en el conjunto de los caracteres definidos por la clase, a menos que el primero sea un circunflejo, en cuyo caso el carácter de la cadena de entrada no debe estar en el conjunto definido por la clase.

source: If a circumflex is actually required as a member of the class, ensure it is not the first character, or escape it with a backslash.
es: Si un circunflejo es necesitado como un miembro de la clase, asegúrate que no es el primero o es precedido por una barra invertida.

source: For example, the character class [aeiou] matches any lower case vowel, while [^aeiou] matches any character that is notFor example, the character class [aeiou] matches any lower case vowel, while [^aeiou] matches any character that is not a lower case vowel.
es: Por ejemplo, la clase carácter [aeiou] empareja cualquier vocal minúscula, mientras [^aeiou] casa cualquier carácter que no sea una vocal minúscula.

source: Note that a circumflex is just a con - venient notation for specifying the characters which are inNote that a circumflex is just a con - venient notation for specifying the characters which are in the class by enumerating those that are not.
es: Ten en cuenta que un circunflejo es una notación convenida para especificarTen en cuenta que un circunflejo es una notación convenida para especificar los caracteres que están en la clase enumerando los que no lo están.

source: It is not an assertion: it still consumes a character from the subject string, and fails if the current pointer is at the end of the string.
es: No es una sentencia: consume un carácter de la cadena de entrada y falla si el punto actual es final.
